index.tex
% Created 2023-06-10 Sat 15:26
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\author{Maxwell Morris}
\date{2021-12-19 Sun}
\title{Maxwell Morris\\\medskip
\large About Me}
\hypersetup{
 pdfauthor={Maxwell Morris},
 pdftitle={Maxwell Morris},
 pdfkeywords={},
 pdfsubject={Home page for my website},
 pdfcreator={Emacs 28.2 (Org mode 9.6)}, 
 pdflang={English}}
\usepackage{biblatex}
\addbibresource{/Users/maxwellmorris/Dropbox/Uni/MyThesis/References/ThesisBib.bib}
\begin{document}

\maketitle
\section*{About Me}
\label{sec:orgde23764}

\begin{quote}
I am an Electrical and Electronic Engineering student at Curtin University where I am currently doing my honours thesis. My interests are in software defined radio, electronics, PCB design and STEM outreach.
\end{quote}

\section*{Work Experience}
\label{sec:org2ddc912}
\textbf{ICRAR}\footnote{(International Centre for Radio Astronomy Research)} 2023 Sem 1 \emph{Research Assistant}
\begin{itemize}
\item Working with Software Defined Radios.
\end{itemize}
\textbf{BinarX} 2022-2023 \emph{Summer Intern}
\begin{itemize}
\item Simple PCB Design and board layout in Altium.
\item Embedded C programming.
\item Ran PCB design workshop for students.
\end{itemize}
\textbf{GPA Engineering} 2022 - Present \emph{Electrical and Instrumentation Undergraduate Engineer}
\begin{itemize}
\item Writing SCADA and PLC logic tests. Writing Factory Acceptance Testing and Site Acceptance Testing reports for brownfield extension to compression stations.
\item Creating electrical diagrams in Autocad
\end{itemize}

\section*{Posts}
\label{sec:org5adb0f4}
\begin{center}
\begin{tabular}{lllll}
 & Title &  &  & Date\\
\hline
 & \href{Posts/EmbeddedReport.pdf}{Embedded Systems Design Lab Report} &  &  & \textit{[2023-06-10 Sat]}\\
 & \href{Posts/MaxwellMorris\_ISI\_Lab.pdf}{Communications Engineering ISI Lab Report} &  &  & \textit{[2023-06-10 Sat]}\\
\end{tabular}
\end{center}


\section*{References}
\label{sec:orge89f043}
This webpage uses \href{https://github.com/rougier/notebook-mode}{Rougier's} notebook template [2021]
\end{document}
